Reports/pcru_ex_ОтчетПоСтатьямРасходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Report>
		<Properties>
			<Name>pcru_ex_ОтчетПоСтатьямРасходов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Дата1</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата2</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БНФОСчетаАналитическогоУчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БНФОСубконто</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяРасходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрочиеДоходыИРасходы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Reports/pcru_ex_ОтчетПоСтатьямРасходов/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Процедура ПриОткрытииНаСервере()
	ЭтаФорма.Отчет.Дата1 = НачалоМесяца(ТекущаяДата());
	ЭтаФорма.Отчет.Дата2 = КонецМесяца(ТекущаяДата());
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры

&НаКлиенте
Функция ВычислитьСуммуВыделенныхЯчеекТабличногоДокумента(ПолеТабличногоДокумента) Экспорт
	
	Сумма = 0;
	Для Каждого Область Из ПолеТабличногоДокумента.ВыделенныеОбласти Цикл
		Если ТипЗнч(Область) = Тип("ОбластьЯчеекТабличногоДокумента") Тогда
			Для ИндексСтрока = Область.Верх По Область.Низ Цикл
				Для ИндексКолонка = Область.Лево По Область.Право Цикл
					Попытка
						Сумма = Сумма + Число(СтрЗаменить(ПолеТабличногоДокумента.Область("R" + Формат(ИндексСтрока, "ЧГ=0") + "C" + Формат(ИндексКолонка, "ЧГ=0")) .Текст, " ", ""));
					Исключение
					КонецПопытки;
				КонецЦикла;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	//
	Возврат Сумма;
	
КонецФункции

&НаКлиенте
Процедура РезультатПриАктивизации(Элемент)
	ЭтаФорма.СуммаПоВыделеннымЭлементам = ВычислитьСуммуВыделенныхЯчеекТабличногоДокумента(Этаформа.Результат);
КонецПроцедуры

//*******************************************************************************
&НаСервере
Функция Комплектность();
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	БНФОСчетаАналитическогоУчета.Ссылка КАК Ссылка,
	|	БНФОСчетаАналитическогоУчета.Наименование КАК Наименование
	|ИЗ
	|	Справочник.БНФОСчетаАналитическогоУчета КАК БНФОСчетаАналитическогоУчета
	|ГДЕ
	|	БНФОСчетаАналитическогоУчета.Владелец.Код = ""20501""";
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Список = Новый СписокЗначений;	
	Пока Выборка.Следующий() Цикл
	Список.Добавить(Выборка.Ссылка,Выборка.Наименование);	
	КонецЦикла;
	//Список.ЗагрузитьЗначения(РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка"));
	Возврат Список;
КонецФункции



&НаКлиенте
Процедура СчетНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Оп = Новый ОписаниеОповещения("ВыполнитьПослеВыбора", ЭтотОбъект, "Параметр");
	ПоказатьВыборИзСписка(Оп, Комплектность(), Элементы.Счет);
КонецПроцедуры


&НаКлиенте
Процедура ВыполнитьПослеВыбора(ВыбЭлемент, Параметры) Экспорт
	Если ВыбЭлемент = Неопределено Тогда
		Сообщить("Не выбран элемент.");
	Иначе
		Отчет.Счет = ВыбЭлемент.Значение;
	КонецЕсли;
КонецПроцедуры
//*******************************************************************************

&НаСервере
Функция ТипыЗатрат();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	БНФОСубконто.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.БНФОСубконто КАК БНФОСубконто
	|ГДЕ
	|	БНФОСубконто.Наименование = ""Тип затрат 1""
	|	ИЛИ БНФОСубконто.Наименование = ""Тип затрат 2""";
	РезультатЗапроса = Запрос.Выполнить();
	Список = Новый СписокЗначений;	
	Список.ЗагрузитьЗначения(РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка"));
	Возврат Список;
	
КонецФункции


&НаКлиенте
Процедура ТипЗатратНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Оп = Новый ОписаниеОповещения("ТипЗатратВыполнитьПослеВыбора", ЭтотОбъект, "Параметр");
	ПоказатьВыборИзСписка(Оп, ТипыЗатрат(), Элементы.ТипЗатрат);

КонецПроцедуры

&НаКлиенте
Процедура ТипЗатратВыполнитьПослеВыбора(ВыбЭлемент, Параметры) Экспорт
	Если ВыбЭлемент = Неопределено Тогда
		Сообщить("Не выбран элемент.");
	Иначе
		Отчет.ТипЗатрат = ВыбЭлемент.Значение;
	КонецЕсли;
КонецПроцедуры
